VOCABULARY
LIST
Cambridge
English
Preliminary
Cambridge
English
Preliminar
y
for
Schools
Cambridge
English
Preliminary
Wordlist
UCLES
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
Introduction
to
the
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabulary
List
The
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabulary
List
gives
teach
ers
a
guide
to
the
vocabulary
needed
when
preparing
student
s
for
the
Preliminary
and
Preliminary
for
Schools
exam
ination
s
Background
to
the
list
The
Preliminary
and
Preliminary
for
Schools
Vocabula
ry
List
was
originall
y
developed
by
Cambridg
e
English
in
consultation
with
exter
nal
consultant
s
to
guide
item
writer
s
who
produce
material
s
for
the
Preliminary
and
Preliminary
for
Schools
exam
inatio
n
It
includ
es
vocabula
ry
from
the
Council
of
Europ
e
s
Threshol
d
specific
ation
and
other
vocabula
ry
which
corpu
s
evidence
show
s
is
high
frequency
The
list
covers
vocabulary
appropriate
to
the
B
level
on
the
Commo
n
European
Framew
ork
of
Referen
ce
CEFR
and
includes
receptive
vocabul
ary
words
that
the
candidat
e
is
expected
to
unders
tand
but
which
is
not
the
focus
of
a
question
and
productive
vocabula
ry
words
that
the
candidat
e
need
s
to
know
to
answe
r
a
question
The
list
does
not
provi
de
an
exhau
stive
list
of
all
word
s
which
appear
on
the
Preliminary
and
Preliminary
for
Schools
questio
n
papers
and
candidates
shou
ld
not
confin
e
their
study
of
vocabul
ary
to
the
list
alone
How
the
list
is
updated
The
vocabu
lary
of
Englis
h
change
s
over
time
with
words
being
added
and
other
words
fallin
g
into
disuse
In
order
to
mainta
in
its
currency
the
Preliminary
and
Preliminary
for
Schools
Vocabu
lary
List
is
update
d
on
an
annual
basis
with
the
decision
to
add
or
remove
words
being
informed
by
reference
to
the
Cambridge
Learner
Corpus
and
Engl
ish
Profile
Wordlists
The
Cambridge
Learner
Corpus
is
a
collection
of
over
million
word
s
of
English
based
upon
evidence
of
language
use
by
learners
from
all
over
the
world
and
from
which
the
En
glish
Vocabulary
Profile
has
develo
ped
The
English
Vocabul
ary
Profile
shows
the
most
common
words
and
phrase
s
that
learn
ers
of
Englis
h
need
to
know
in
Britis
h
or
America
n
English
The
meanin
g
of
each
word
or
phrase
in
the
wordlists
has
been
assigne
d
a
level
between
A
and
B
on
the
CEFR
A
preview
versio
n
of
the
English
Vocabulary
Profile
can
be
accessed
by
visiting
the
website
http
www
englishprofi
le
org
Organisation
of
the
list
Word
sets
Some
categ
ories
of
words
that
a
learner
at
this
level
migh
t
be
expected
to
know
e
g
days
of
the
week
are
not
include
d
in
the
alpha
betical
list
but
are
listed
in
Appendi
x
Although
gramma
r
words
pronouns
modal
verbs
etc
are
included
the
Language
Specification
section
of
the
Preliminary
and
Preliminary
for
Schools
Handbook
available
from
http
www
cambridgeenglish
org
shoul
d
be
consulted
for
a
more
complet
e
listing
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
Exemplification
Exampl
e
phrases
and
sentences
showing
how
words
might
be
used
are
given
only
where
words
with
differen
t
meanings
need
to
be
constrained
For
examp
le
heel
is
followed
by
I
can
t
walk
in
high
heels
this
shows
that
heel
is
limite
d
to
the
idea
of
shoes
candid
ates
are
not
expe
cted
to
know
other
meanings
such
as
the
part
of
the
body
Multi
word
Verbs
Multi
word
verbs
are
not
include
d
in
the
list
if
they
have
a
litera
l
meanin
g
and
are
compose
d
of
verbs
and
particle
s
alread
y
in
the
list
Exam
ples
of
literal
multi
word
verbs
are
come
into
sit
down
as
in
Why
not
come
into
the
kitche
n
and
sit
down
If
the
meaning
of
the
verb
is
not
transparent
e
g
find
out
get
along
give
in
then
the
verb
is
listed
and
an
exampl
e
of
usag
e
given
Topic
lists
In
Appendi
x
word
s
have
been
grouped
togethe
r
under
commo
n
Preliminary
and
Preliminary
for
Schools
themes
such
as
Food
and
Drink
House
and
Hom
e
and
Sport
Unsuitabl
e
topics
Cambri
dge
English
examination
s
must
not
contai
n
anything
that
might
offen
d
or
upset
candidates
potentially
affect
their
performanc
e
or
distrac
t
them
durin
g
the
exami
nation
A
numbe
r
of
sensitive
topics
are
consider
ed
unsuitabl
e
for
use
in
Preliminary
and
Preliminary
for
Schools
for
exampl
e
war
and
politics
and
vocabul
ary
relatin
g
to
these
is
not
include
d
in
the
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
Personal
vocabulary
The
conten
t
of
the
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
is
general
in
nature
and
is
unlikel
y
to
cover
completel
y
the
productive
vocabu
lary
that
may
be
required
by
all
cand
idates
Candidates
should
know
the
specific
lexis
they
will
need
to
desc
ribe
themselve
s
and
their
lives
for
exampl
e
hobbies
likes
and
dislikes
Abbreviations
Abbrev
iations
used
in
the
Preliminary
and
Preliminary
for
Schools
Vocabulary
List
are
abbrev
adj
adv
av
Am
Eng
Br
Eng
conj
det
exclam
abbreviatio
n
or
acronym
adjective
adverb
auxiliar
y
verb
America
n
Engli
sh
British
Engli
sh
conjun
ction
determiner
excla
mation
mv
n
phrv
pi
prep
prep
phr
pron
sing
v
moda
l
verb
noun
phrasa
l
verb
plura
l
prepo
sition
prepositiona
l
phrase
pronoun
singular
verb
Summar
y
of
points
to
be
noted
The
list
does
not
include
every
word
that
may
appe
ar
on
a
Cambridge
English
Preliminary
and
Preliminary
for
Schools
paper
The
list
cove
rs
receptive
and
productive
vocabular
y
The
list
is
updated
every
year
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
Contents
A
B
C
D
E
F
G
H
I
J
K
L
M
N
O
P
Q
R
S
T
U
V
W
Y
Z
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
A
a
an
det
ability
n
able
adj
be
able
to
about
adv
prep
about
students
adv
The
film
is
about
a
small
boy
prep
above
adj
adv
prep
abroad
adv
absent
adj
absolutely
adv
The
movie
was
absolutely
awful
accent
n
She
has
a
beautiful
French
accent
accept
v
access
n
disabled
access
internet
access
accident
n
accommodation
n
accompany
v
according
to
prep
phr
account
n
accountant
n
accurate
adj
ache
n
achieve
v
across
adv
prep
act
n
v
in
the
second
act
of
the
play
n
to
act
in
a
play
v
to
act
strangely
v
action
n
active
adj
activity
n
actor
n
actress
n
actually
adv
She
seems
a
bit
strict
at
first
but
she
s
actually
very
nice
Are
you
actually
going
to
take
the
job
ad
advertisement
n
add
v
addition
n
in
addition
address
n
admire
v
admission
n
charges
cost
price
admit
v
adult
adj
n
advance
n
book
in
advance
advanced
adj
advantage
n
adventure
n
advert
n
advertise
v
advertisement
n
advice
n
advise
v
aeroplane
n
afford
v
afraid
adj
after
adv
conj
prep
afternoon
n
afterwards
adv
again
adv
against
prep
age
n
aged
adj
agency
n
ago
adv
agree
v
ahead
adv
aim
n
v
air
n
air
conditioning
n
air
force
n
airline
n
airport
n
alarm
n
alarm
clock
n
album
n
alike
adv
alive
adj
all
adj
adv
det
pron
all
right
alright
adj
adv
exclam
allow
v
almost
adv
alone
adv
adj
along
adv
prep
aloud
adv
alphabet
n
already
adv
also
adv
although
conj
altogether
adv
always
adv
a
m
adv
amazed
adj
amazing
adj
ambition
n
ambulance
n
among
amongst
prep
amount
n
amusing
adj
an
det
ancient
adj
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
and
conj
angry
adj
animal
n
ankle
n
anniversary
n
anno
unce
v
anno
uncem
ent
n
annoy
v
annu
al
adj
another
det
pron
answe
r
n
v
answer
phone
n
ant
n
antiqu
e
adj
n
anxious
adj
any
det
pron
anybody
pron
anym
ore
adv
anyone
pron
anythi
ng
pron
anyway
adv
anywhe
re
adv
apart
adv
apart
from
adv
apartmen
t
n
apartmen
t
building
n
apologise
v
apology
n
appe
ar
v
appe
arance
n
apple
n
applicatio
n
n
apply
v
appointme
nt
n
approach
v
approve
v
architect
n
architecture
n
area
n
argue
v
argume
nt
n
arm
n
armchai
r
n
army
n
around
adv
prep
arrange
v
arrangem
ent
n
arres
t
v
arriva
l
n
arrive
v
art
n
articl
e
n
artist
n
as
conj
prep
ashamed
adj
ask
v
asleep
adj
aspirin
n
assistant
n
as
well
as
prep
adv
at
prep
at
I
n
My
emai
l
addres
s
is
david
c
ambridgeenglish
org
at
all
prep
phr
at
first
prep
phr
athle
te
n
athletics
n
at
last
prep
phr
at
least
prep
phr
atmospher
e
n
at
once
prep
phr
at
presen
t
prep
phr
attach
v
attack
n
v
attempt
v
atten
d
v
attentio
n
n
at
the
same
time
prep
phr
attitud
e
n
attract
v
attractio
n
n
attracti
ve
adj
audience
n
aunt
n
autho
r
n
autum
n
n
Br
Eng
Am
Eng
fall
available
adj
average
adj
n
avoid
v
awak
e
adj
away
adv
awful
adj
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
B
baby
n
babysi
t
v
babysitte
r
n
back
adv
adj
n
background
n
backpack
n
backpack
er
n
backpackin
g
n
backwards
adv
bad
adj
badly
adv
badminton
n
bag
n
bagg
age
n
bake
v
baker
n
balcon
y
n
bald
adj
ball
n
ballet
n
balloo
n
n
bana
na
n
band
n
band
age
n
bank
n
bank
account
n
bankin
g
n
bar
n
barbecue
n
v
basebal
l
n
base
on
phr
v
basic
adj
basin
n
basket
n
basketball
n
bat
n
bath
n
v
bathin
g
suit
n
bathr
oom
n
bathtu
b
n
batter
y
n
battle
n
bay
n
be
av
v
beac
h
n
bean
n
bear
n
beard
n
beat
v
beautiful
adj
beaut
y
n
becaus
e
conj
becaus
e
of
prep
phr
become
v
bed
n
bedroom
n
bee
n
beef
n
befor
e
prep
adv
conj
begin
v
begin
ner
n
beginn
ing
n
beha
ve
v
beha
viour
n
behin
d
prep
adv
believ
e
v
bell
n
belong
v
below
adv
prep
belt
n
bene
ath
prep
benefi
t
n
be
over
phr
v
The
game
is
over
you
re
too
late
beside
adv
prep
beside
s
prep
best
adj
adv
bette
r
adj
adv
betwe
en
prep
adv
beyond
prep
adv
bicycle
n
big
adj
bike
n
bill
n
electricity
bill
bin
n
biogr
aphy
n
biology
n
bird
n
birth
n
birthday
n
biscuit
n
bit
n
bite
v
bitter
adj
black
adj
n
blackboar
d
n
blam
e
v
blank
adj
a
blank
piece
of
paper
blanke
t
n
bleed
v
blind
adj
block
n
Shall
we
walk
round
the
block
blog
n
blogger
n
blond
e
adj
blood
n
blous
e
n
blow
v
blue
adj
n
board
n
v
board
game
n
boarding
pass
n
boat
n
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
body
n
boil
v
boiled
adj
bold
adj
bomb
n
v
bone
n
book
n
v
bookc
ase
n
booking
n
I
have
a
booking
for
the
th
booking
office
n
bookshelf
n
booksho
p
n
Br
Eng
Am
Eng
bookstore
bookstor
e
n
Am
Eng
Br
Eng
booksh
op
boot
n
a
pair
of
boots
the
boot
of
the
car
Am
Eng
trunk
border
n
bored
adj
boring
adj
born
adj
borrow
v
boss
n
both
pron
det
bothe
r
v
Sorry
to
bother
you
can
you
tell
me
the
time
My
job
s
hard
but
that
doesn
t
bother
me
Sorry
I
m
late
I
ll
do
it
now
Don
t
bother
bottle
n
bottom
adj
n
bowl
n
box
n
boy
n
boyfriend
n
bracelet
n
brain
n
brake
n
v
branch
n
brand
new
adj
brave
adj
bread
n
break
n
v
break
down
phr
v
The
car
has
broken
down
breakfast
n
break
in
phr
v
Someone
broke
in
and
stole
the
computer
break
up
phr
v
When
does
school
break
up
The
pop
group
has
broken
up
breath
n
breathe
v
breez
e
n
bride
n
bridge
n
brief
adj
bright
adj
brilliant
adj
bring
v
bring
up
phr
v
She
was
brought
up
in
London
broad
adj
broccoli
n
brochure
n
broken
adj
broth
er
n
brown
adj
n
brush
n
v
bucket
n
bug
n
build
v
building
n
bulb
n
light
bulb
bull
n
bunch
n
a
bunch
of
flowers
a
great
bunch
of
friends
burger
n
burn
v
burni
ng
adj
bury
v
bus
n
business
n
businessman
n
busine
sswoman
n
bus
station
n
bus
stop
n
busy
adj
but
conj
prep
butcher
n
butter
n
butterfl
y
n
button
n
buy
v
buyer
n
by
prep
by
accid
ent
prep
phr
bye
ex
clam
by
hand
prep
phr
by
mista
ke
prep
phr
by
name
prep
phr
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
C
cab
n
cabbage
n
cabin
n
cabinet
n
cable
n
cafe
cafe
n
cafeteri
a
n
cage
n
cake
n
calculat
or
n
calendar
n
calf
n
call
n
v
call
for
phr
v
I
ll
call
for
you
at
call
in
phr
v
She
called
in
to
see
a
friend
calm
adj
camel
n
came
ra
n
camp
n
v
camping
n
campsite
n
can
n
mv
cana
l
n
cancel
v
candidat
e
n
candl
e
n
cand
y
n
cantee
n
n
cap
n
capital
adj
n
capital
city
capital
letter
the
capital
of
Italy
captai
n
n
car
n
card
n
birthd
ay
card
credit
card
card
game
cardbo
ard
adj
n
care
n
v
take
care
of
someon
e
n
to
care
about
for
someone
something
v
career
n
carefu
l
adj
carefull
y
ad
careless
adj
car
park
n
Br
Eng
Am
Eng
parkin
g
lot
carpet
n
carrot
n
carry
v
carry
on
phr
v
He
carried
on
walking
despite
the
rain
carry
out
phr
v
She
carried
out
the
plan
according
to
the
instructions
cartoo
n
n
case
n
Would
you
like
me
to
carry
your
case
I
ll
make
an
exception
in
this
case
cash
n
cashpoint
n
castle
n
casual
adj
casual
clothes
cat
n
catch
v
cathedral
n
cattle
n
cave
n
CD
n
CD
player
n
CD
Rom
n
ceilin
g
n
celebrat
e
v
celebratio
n
n
celebrit
y
n
cell
phone
n
cent
n
centimetre
I
centimete
r
em
n
centra
l
adj
centra
l
heatin
g
n
centre
cente
r
n
centur
y
n
cereal
n
ceremon
y
n
certai
n
adj
certainl
y
not
adv
certificate
n
chain
n
chair
n
challenge
n
challengin
g
adj
champio
n
n
championshi
p
n
chanc
e
n
chang
e
n
v
changing
room
n
channel
n
chapte
r
n
characte
r
n
charg
e
n
v
charity
n
charming
adj
chat
n
chatroom
n
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
chat
show
n
Br
Eng
Am
Eng
talk
show
chea
p
adj
chea
t
v
check
n
v
check
in
phr
v
They
checked
in
to
a
hotel
check
in
n
Your
keys
are
at
the
check
in
desk
check
out
phr
v
He
checked
out
of
the
hotel
at
the
end
of
his
stay
checkout
n
cheek
n
cheer
ful
adj
cheers
excla
m
chees
e
n
chef
n
chemis
t
n
chemistry
n
cheque
n
chess
n
ches
t
of
drawers
n
chicken
n
child
n
childhood
n
chilli
n
chin
n
chip
n
I
love
fish
and
chips
chocolat
e
n
choice
n
choos
e
v
cinem
a
n
circle
n
circus
n
city
n
clap
v
class
n
langu
age
class
first
class
second
class
class
ical
adj
class
ical
music
classmat
e
n
classroom
n
clean
adj
v
cleane
r
n
clear
adj
v
clearl
y
adv
cleve
r
adj
click
n
v
cliff
n
climate
n
climb
v
climbin
g
n
clinic
n
clock
n
close
adj
adv
v
close
d
adj
clothes
n
pi
cloud
n
cloud
y
adj
clown
n
club
n
to
join
a
club
coac
h
n
coast
n
coat
n
coconut
n
cod
n
coffee
n
coin
n
cola
n
cold
adj
n
collar
n
colleague
n
collect
v
collection
n
colleg
e
n
colour
n
v
colourfu
l
adj
comb
n
v
come
v
comed
y
n
come
on
phr
v
Come
on
or
we
ll
miss
the
bus
comfort
n
comfortabl
e
adj
comic
adj
n
comma
n
commo
n
adj
a
common
surname
have
something
in
common
communica
te
v
communication
n
compan
y
n
compar
e
v
compet
e
v
competition
n
competitor
n
complai
n
v
complaint
n
complet
e
adj
v
complicate
d
adj
compositio
n
n
compute
r
n
concentrat
e
v
concert
n
conclusio
n
n
conditio
n
n
in
good
condition
conference
n
confident
adj
confirm
v
confused
adj
confusin
g
adj
congratulations
exclam
connect
v
connectio
n
n
conside
r
v
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
consis
t
v
consonan
t
n
contact
n
v
contai
n
v
contents
n
contest
n
continen
t
n
continu
e
v
contract
n
contro
l
n
v
a
remot
e
control
Contro
l
your
dog
conveni
ent
adj
conversation
n
convinc
e
v
cook
n
v
cooke
r
n
cookie
n
Am
Eng
Br
Eng
biscuit
cooking
n
cool
adj
exclam
v
copy
n
v
corn
n
corner
n
correct
adj
correctio
n
n
cost
n
v
costume
n
I
forgot
my
swimming
costume
nationa
l
costume
a
Hallowe
en
costume
cosy
adj
cottag
e
n
cotton
n
coug
h
n
v
could
mv
coun
t
v
countr
y
n
countryside
n
coupl
e
n
courag
e
n
cours
e
n
Englis
h
course
main
course
of
cours
e
exclam
court
n
law
court
tennis
court
cousin
n
cove
r
n
v
cow
n
crash
n
v
crazy
adj
cream
adj
n
creat
e
v
creativ
e
adj
creatur
e
n
credit
n
credit
card
n
crew
n
cabin
crew
cricket
n
crime
n
criminal
n
crop
n
cross
n
v
crossing
n
pedestria
n
crossing
cross
out
phr
v
Cross
it
out
and
write
it
again
crossroads
n
crow
d
n
crowde
d
adj
cruel
adj
cruise
n
cry
n
v
cucumbe
r
n
cultural
adj
cultur
e
n
cup
n
cupboa
rd
n
cure
n
v
curiou
s
adj
curiousl
y
adv
Why
she
asked
him
curiously
curly
adj
currenc
y
n
curriculum
n
curry
n
curtai
n
n
cushio
n
n
custom
n
customer
n
customs
n
pi
cut
n
v
cute
adj
cut
up
phr
v
She
cut
up
the
cake
into
small
pieces
CV
Curricu
lum
Vitae
n
cycle
n
v
cycling
n
cyclist
n
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
D
dad
n
daily
adj
adv
damage
n
v
damaged
adj
danc
e
n
v
dance
r
n
dancin
g
n
dang
er
n
dang
erous
adj
dark
adj
n
date
n
v
today
s
date
n
daug
hter
n
day
n
dead
adj
deaf
adj
deal
v
deal
with
sth
phr
v
I
ve
had
some
problems
to
deal
with
dear
adj
exclam
too
dear
to
buy
adj
Dear
Sir
adj
Oh
dear
exclam
death
n
decid
e
v
decision
n
declar
e
v
decorat
e
v
decreas
e
n
v
deep
adj
adv
defea
t
n
v
defenc
e
n
defen
d
v
definitel
y
adv
degree
n
degrees
a
degree
in
maths
delay
n
v
delet
e
v
delicious
adj
delighte
d
adj
delive
r
v
delive
ry
n
demand
n
v
dentist
n
depa
rt
v
depa
rtmen
t
n
depa
rtmen
t
store
n
depa
rture
n
depe
nd
on
upo
n
v
phr
v
It
depends
on
what
you
want
to
do
deposi
t
n
pay
a
deposi
t
depresse
d
adj
depth
n
the
depth
of
the
water
describ
e
v
descriptio
n
n
desert
n
deserve
v
desig
n
n
v
designe
r
n
desk
n
despit
e
prep
dessert
n
destinatio
n
n
destro
y
v
detai
l
n
detective
n
devel
op
v
devel
opment
n
diagram
n
dial
v
diary
n
dictionary
n
die
v
diet
n
differenc
e
n
different
adj
difficult
adj
difficulty
n
dig
v
digital
adj
digital
camer
a
n
dining
room
n
dinne
r
n
dinosau
r
n
diplom
a
n
direct
adj
v
direction
n
directl
y
adv
directo
r
n
dirt
n
dirty
adj
disable
d
adj
disadvant
age
n
disagre
e
v
disappea
r
v
disappoin
t
v
disappointe
d
adj
disappointi
ng
adj
disappoint
ment
n
disc
disk
n
compact
disc
CO
hard
disk
flopp
y
disk
disc
jockey
OJ
n
disco
theque
n
discount
n
discove
r
v
discuss
v
discus
sion
n
diseas
e
n
disgusting
adj
dish
n
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
dishwashe
r
n
disk
n
dislike
v
displa
y
n
v
distanc
e
n
district
n
distur
b
v
dive
v
diver
n
divide
v
diving
n
OJ
disc
jockey
n
do
av
v
docto
r
I
Dr
n
documen
t
n
documenta
ry
n
dog
n
doll
n
dollar
n
dolphi
n
n
donkey
n
door
n
dot
n
Have
you
visited
CambridgeEnglish
org
doubl
e
adj
det
doub
t
n
down
adv
prep
downl
oad
n
v
downstairs
adj
adv
dozen
det
n
Dr
n
drag
v
Just
drag
and
drop
the
file
into
the
trash
can
drama
n
draw
v
to
draw
a
picture
of
someone
or
something
to
draw
the
curtains
to
draw
near
drawer
n
drawi
ng
n
dream
n
v
dress
n
v
dresse
d
adj
drink
n
v
drive
n
v
driver
n
drivin
g
licence
n
drop
n
v
drugstor
e
n
Am
Eng
Br
Eng
chemis
t
drum
n
dry
adj
v
duck
n
due
adj
The
next
bus
is
due
in
five
minutes
due
to
prep
phr
dull
adj
during
prep
dust
n
dustbi
n
n
Br
Eng
Am
Eng
trash
can
dusty
adj
duty
n
duty
free
adj
n
duvet
n
DVD
n
DVD
player
n
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
E
each
det
pron
ear
n
earach
e
n
early
adj
adv
earn
v
earring
n
earth
n
east
ad
j
adv
n
easter
n
adj
easily
adv
easy
adj
easygoi
ng
adj
eat
v
economics
n
edge
n
education
n
effect
n
efficient
adj
effort
n
egg
n
eithe
r
adv
det
pron
elbow
n
elder
adj
elder
ly
adj
electio
n
n
electric
adj
electrical
adj
electricity
n
electronic
adj
elementa
ry
adj
eleph
ant
n
elevat
or
n
Am
Eng
Br
Eng
lift
else
adv
emai
l
n
v
embarrassed
adj
embar
rassing
adj
emba
ssy
n
emerg
ency
n
emplo
y
v
employee
n
employer
n
employm
ent
n
empt
y
adj
encour
age
v
end
n
v
endin
g
n
end
up
phr
v
He
plans
to
end
up
working
in
Australia
enemy
n
energy
n
Team
sports
take
a
lot
of
time
and
energy
In
our
house
we
try
to
save
energy
engaged
adj
to
be
enga
ged
to
someone
The
phone
was
engage
d
engin
e
n
engine
er
n
engine
ering
n
enjoy
v
enormo
us
adj
enou
gh
adv
det
pron
enqui
ry
n
enter
v
entertai
n
v
enterta
inment
n
entrance
n
entry
n
envel
ope
n
environment
n
environmen
tal
adj
equal
adj
equipm
ent
n
eraser
n
Am
Eng
Br
Eng
rubber
escap
e
v
especiall
y
adv
essay
n
essential
adj
euro
n
even
adv
He
could
n
t
even
do
that
even
ing
n
event
n
ever
adv
every
det
everybody
pron
everyone
pron
everythin
g
pron
everywhere
adv
exact
adj
exactl
y
adv
examinati
on
exa
m
n
examiner
n
exampl
e
n
excellen
t
adj
excep
t
prep
conj
excha
nge
n
an
excha
nge
visit
in
exchan
ge
for
exchan
ge
v
exchange
rate
n
excite
d
adj
excit
ement
n
excitin
g
adj
excuse
n
v
exercis
e
n
v
exhausted
adj
exhibitio
n
n
exist
v
exit
n
expect
v
expedition
n
expensive
adj
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
experienc
e
n
experience
d
adj
experimen
t
n
expert
n
explai
n
v
explanation
n
explode
v
explore
v
explorer
n
This
book
s
about
famous
explorers
extra
adj
adv
n
extra
ordinary
adj
extreme
ly
adv
extrem
e
sport
n
eye
n
F
face
n
a
sad
look
on
his
face
face
to
face
adv
face
to
face
adj
facilitie
s
n
pi
The
hotel
has
excellent
facilities
fact
n
factory
n
fail
v
fair
adj
n
fairly
adv
fall
n
v
in
the
fall
n
Am
Eng
Br
Eng
autumn
a
fall
in
the
price
n
he
fell
and
hurt
his
leg
v
false
adj
familia
r
with
adj
family
n
famous
adj
fan
n
fancy
v
Do
you
fancy
going
out
tonight
fantastic
adj
far
adv
fare
n
The
return
fare
is
farm
n
farme
r
n
farmin
g
n
fashio
n
n
fashionabl
e
adj
fast
adj
adv
fasten
v
fast
food
n
fat
adj
father
n
fault
n
favour
n
favourit
e
adj
n
fax
v
fear
n
fee
n
feed
v
feel
v
feeling
n
feel
like
v
to
feel
like
doing
something
femal
e
adj
ferry
n
festival
n
fetch
v
fever
n
few
adj
det
pon
fiction
n
field
n
fight
n
v
figure
n
file
n
Click
here
to
open
the
file
school
files
fill
v
fill
in
phr
v
You
need
to
fill
in
a
form
fill
up
phr
v
He
filled
up
the
car
with
petrol
film
n
v
film
maker
n
film
star
final
adj
n
finally
adv
financial
adj
find
v
find
out
phr
v
I
must
find
out
when
he
s
arriving
fine
adj
n
finge
r
n
finish
n
v
fire
n
firefighte
r
n
firewor
k
n
a
firewor
k
display
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
firm
n
a
good
firm
to
work
for
first
adj
adv
first
prize
adj
first
of
all
adv
first
name
n
fish
n
v
fishin
g
n
fit
adj
v
keep
fit
adj
These
shoes
don
t
fit
v
fitness
n
fix
v
flag
n
flat
adj
n
flavou
r
n
flight
n
float
v
flood
n
v
floor
n
flour
n
flow
v
flowe
r
n
flu
n
flute
n
fly
n
v
fog
n
foggy
adj
fold
v
folk
adj
n
follow
v
followin
g
adj
fond
adj
to
be
fond
of
something
someone
food
n
fool
n
foot
n
football
n
footba
ller
n
for
prep
forbidd
en
adj
forecast
n
foreig
n
adj
foreign
er
n
forest
n
forev
er
adv
forge
t
v
forgiv
e
v
fork
n
form
n
forme
r
adj
fortnight
n
fortunatel
y
adv
forward
s
adv
founta
in
n
frame
n
free
adj
adv
freeze
v
freezer
n
freezin
g
adj
Frenc
h
fries
n
Am
Eng
Br
Eng
chips
frequ
ent
adj
fresh
adj
fridge
n
fried
adj
friend
n
friendl
y
adj
friendshi
p
n
frighte
n
v
frightened
adj
frightening
adj
frog
n
from
prep
front
adj
n
froze
n
adj
fruit
n
fry
v
frying
pan
n
fuel
n
full
adj
full
stop
n
full
time
adv
full
time
adj
fully
adv
fun
adj
n
funny
adj
a
funny
story
amusing
a
funny
thing
happened
strange
fur
n
furnitur
e
n
further
adv
adj
furthest
adj
future
adj
n
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
G
gain
v
gain
experience
gallery
n
an
art
gallery
game
n
gap
n
garage
n
garden
game
n
gap
n
garage
n
garden
n
garlic
n
gas
n
Am
Eng
Br
Eng
petrol
gas
station
n
Am
Eng
Br
Eng
petrol
station
gate
n
general
adj
generally
adv
generally
get
home
about
generation
n
generous
adj
gentle
adj
geography
n
get
v
get
along
with
v
phr
v
How
do
you
get
along
with
Harry
get
back
phr
v
When
did
you
get
back
from
New
York
get
down
phr
v
Get
down
at
once
Did
you
get
all
the
notes
down
get
fit
v
get
in
phr
v
Can
you
get
in
through
the
window
get
off
phr
v
We
get
off
at
the
next
stop
get
on
phr
v
Get
your
coat
on
and
then
we
can
leave
How
are
you
getting
on
now
get
on
with
phr
v
She
got
on
with
her
work
I
m
getting
on
well
with
French
Do
you
get
on
well
with
Sam
get
rid
of
phr
v
Have
you
got
rid
of
those
old
documents
get
up
phr
v
What
time
do
you
get
up
in
the
morning
giant
adj
gift
n
giraffe
n
girl
n
girlfriend
n
give
v
give
back
phr
v
Give
me
back
this
book
on
Tuesday
please
give
in
phr
v
Have
you
given
in
your
homework
yet
Do
you
give
in
Shall
I
tell
you
now
give
out
phr
v
Will
you
give
out
these
papers
for
me
please
give
up
phr
v
Has
David
given
up
playing
tennis
give
way
phr
v
You
must
give
way
to
traffic
at
a
roundabout
glad
adj
glance
v
glass
n
glasses
n
pi
global
warming
n
glove
n
go
v
goal
n
goalkeeper
n
goat
n
go
for
phr
v
He
went
for
the
job
The
dog
went
for
the
man
gold
adj
n
golden
adj
golf
n
good
adj
The
film
was
very
good
to
be
good
at
maths
good
afternoon
exclam
good
looking
adj
good
morning
exclam
go
off
phr
v
They
went
off
to
Australia
Suddenly
the
lights
went
off
go
on
phr
v
The
meeting
went
on
until
six
o
clock
What
s
going
on
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
go
out
phr
v
Are
you
going
out
this
evening
The
fire
has
gone
out
Is
Barbar
a
still
going
out
with
Thomas
or
have
they
broken
up
gorgeous
adj
government
n
go
with
tog
ether
phr
v
Your
tie
doesn
t
go
with
your
shirt
Your
tie
and
shirt
don
t
go
together
grab
v
He
grabbed
my
bag
and
ran
away
grade
n
graduation
n
gram
me
n
gramma
r
n
grandchild
n
grand
d
ad
n
granddaughter
n
grandfather
n
grandma
n
grandmothe
r
n
grandpa
n
grandparent
n
grandson
n
granny
n
grant
n
He
was
given
a
grant
to
study
in
Australia
n
grape
n
graphics
n
pi
grass
n
grateful
adj
great
adj
green
adj
n
greet
v
greetin
g
n
grey
adj
n
Br
Eng
Am
Eng
gray
grill
n
v
grille
d
adj
groce
ry
store
n
Am
Eng
groom
n
ground
n
group
n
grow
v
grow
up
phr
v
Childr
en
grow
up
fast
guard
n
guess
n
v
guest
n
guest
hous
e
n
guide
n
v
guide
book
n
guilty
adj
guita
r
n
guitarist
n
gum
n
chewin
g
gum
gun
n
guy
n
gym
n
gymnastics
n
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
H
habit
n
hair
n
haircu
t
n
hairdr
esse
r
n
hairdr
yer
n
half
adv
det
n
pron
half
price
adj
hall
n
hand
n
v
hand
bag
n
hand
held
adj
hand
in
phr
v
Please
hand
in
the
answer
sheet
when
you
ve
finished
handkerchief
n
handl
e
v
hand
out
phr
v
Hand
out
the
books
please
Tom
handsom
e
adj
hand
writin
g
n
hang
v
to
hang
a
picture
hang
out
phr
v
to
hang
out
with
friends
hang
up
phr
v
She
hung
up
at
the
end
of
the
phone
call
happ
en
v
happy
adj
happi
ly
adv
happin
ess
n
harbour
n
hard
adj
adv
hardl
y
adv
hardly
any
time
He
could
hardly
wait
hardware
n
hat
n
hate
v
have
av
v
have
got
to
mv
have
to
mv
he
pron
head
n
to
hit
one
s
head
n
the
head
of
the
compan
y
n
the
head
of
the
school
n
head
ache
n
headli
ne
n
headt
eacher
n
healt
h
n
healthy
adj
hear
v
heart
n
heat
n
heating
n
heater
n
heavy
adj
heel
n
I
can
t
walk
in
high
heels
height
n
helicopter
n
hello
exclam
helmet
n
help
n
v
her
det
pron
herb
n
here
adv
hero
n
heroi
ne
n
The
heroine
of
this
story
is
a
young
schoolgirl
hers
pron
hersel
f
pron
hey
exclam
hi
exclam
hidden
adj
hide
v
high
adj
adv
hill
n
him
pron
himsel
f
pron
hip
hop
n
hire
v
n
to
hire
a
boat
v
for
hire
n
his
det
pron
historic
adj
historical
adj
histor
y
n
hit
n
v
The
song
was
a
great
hit
n
to
hit
the
ball
v
hitchhike
v
hobby
n
hockey
n
hold
v
hold
up
phr
v
He
was
held
up
in
the
heavy
traffic
for
over
two
hours
hole
n
holida
y
n
home
adv
n
homepa
ge
n
homew
ork
n
honest
adj
honestl
y
adv
I
honestly
don
t
know
where
she
is
honey
n
hone
ymoon
n
hope
n
v
hopefu
l
adj
hopefull
y
adv
Hopefully
the
journey
won
t
take
long
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
hopeless
adj
a
hopeless
situation
horrib
le
adj
horror
adj
a
horror
movie
horse
n
hospital
n
hostel
n
hot
adj
hotel
n
hour
n
hous
e
n
housewif
e
n
housewo
rk
n
how
adv
howe
ver
adv
how
much
adv
hug
n
v
huge
ad
j
huma
n
adj
n
humi
d
adj
hung
er
n
hung
ry
adj
hunt
v
hurry
n
v
hurt
adj
v
husband
n
hut
n
I
I
pron
ice
n
ice
cream
n
ice
hocke
y
n
ice
skating
n
icy
adj
ID
n
ID
card
n
idea
n
identificatio
n
n
identit
y
card
ID
n
if
conj
ill
adj
illness
n
imagination
n
imagin
e
v
immediatel
y
adv
immigratio
n
n
importanc
e
n
importan
t
adj
impossible
adj
improv
e
v
improvem
ent
n
in
adv
prep
in
advance
prep
phr
inch
n
include
v
including
prep
incorrect
adj
increa
se
v
incredibl
e
adj
indee
d
adv
indep
endent
adj
individ
ual
adj
indoo
r
adj
indoor
s
adv
industr
y
n
in
fact
prep
phr
inform
v
informatio
n
n
in
front
of
prep
phr
ingredi
ent
n
I
always
use
fresh
ingredients
in
half
prep
phr
in
ink
prep
phr
initial
n
His
initials
are
J
B
H
injure
v
ink
n
in
love
prep
phr
in
penci
l
prep
phr
in
order
prep
phr
in
order
to
prep
phr
inquir
y
n
insect
n
inside
adv
prep
insist
v
install
v
instanc
e
n
for
instance
instea
d
of
adv
There
were
no
lemons
so
I
got
oranges
instead
Can
you
come
on
Monday
instead
of
Tuesday
instructions
n
pi
instructor
n
instrument
n
musical
instrument
intelligen
t
adj
intend
v
to
inten
d
to
do
something
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
interest
n
v
interested
adj
interesting
adj
intermediat
e
adj
internation
al
adj
internet
n
interrupt
v
interva
l
n
an
interva
l
in
a
play
intervie
w
n
v
in
the
end
prep
phr
in
time
prep
phr
into
prep
introduc
e
v
introductio
n
n
in
two
prep
phr
inven
t
v
inventio
n
n
invitation
n
invite
v
involv
e
v
iron
n
v
ironing
n
island
n
issue
n
IT
Informatio
n
Techno
logy
n
it
pron
item
n
its
det
itself
pron
J
jacket
n
jail
n
Am
Eng
Br
Eng
prison
jam
n
strawber
ry
jam
traffic
jam
jar
n
jazz
n
jealous
adj
jeans
n
pi
jet
n
to
go
by
jet
plane
jewelle
ry
n
Br
Eng
Am
Eng
jewelry
job
n
jog
v
jogging
join
v
The
rivers
join
there
to
join
the
army
to
join
in
a
game
joke
n
v
journalis
t
n
journey
n
judge
n
v
jug
n
juice
n
jump
n
v
jumper
n
jungle
n
just
adv
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
K
kangar
oo
n
keen
adj
He
s
keen
on
cyclin
g
to
be
keen
to
do
something
keep
v
keeper
n
keep
in
phr
v
She
kept
the
children
in
as
it
was
so
cold
keep
on
phr
v
He
kept
on
talking
keep
up
phr
v
Keep
up
the
good
work
kettle
n
key
n
key
to
a
lock
key
to
succe
ss
keybo
ard
n
compute
r
keyboard
keybo
ard
music
kick
n
v
kid
n
We
re
taking
the
kids
camping
kill
v
kilogramm
e
kg
n
Br
Eng
Am
Eng
kilogram
kilometr
e
km
n
Br
Eng
Am
Eng
kilometer
kind
adj
n
king
n
kiss
n
v
kit
n
kitche
n
n
kite
n
kitten
n
knife
n
knit
v
knock
v
knock
down
phr
v
He
was
knocked
down
by
the
car
as
he
stepped
into
the
road
know
v
knowledge
n
knee
n
L
label
n
laborat
ory
lab
n
lack
n
ladder
n
lady
n
lake
n
lamb
n
lamp
n
land
n
v
landscap
e
n
langu
age
n
laptop
com
puter
n
large
adj
last
adj
adv
det
v
late
adj
adv
lately
adv
later
adj
adv
latest
adj
laugh
n
v
law
n
lawye
r
n
lay
v
lay
the
table
lazy
adj
lead
v
to
lead
someone
by
the
hand
Wher
e
does
this
road
lead
leade
r
n
leaf
n
leagu
e
n
learn
v
least
adj
adv
the
least
amoun
t
adj
at
least
adv
leathe
r
n
leave
v
lecture
n
left
n
adj
adv
left
hand
adj
leg
n
leisure
n
lemon
n
lemonade
n
lend
v
length
n
less
adv
det
pron
lesson
n
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
let
v
Let
her
do
it
Let
me
think
Let
s
go
out
tonight
letter
n
lettuce
n
level
n
library
n
licence
n
a
driv
ing
marriage
TV
licence
lie
n
v
lie
down
phr
v
life
n
lift
n
v
Can
you
give
me
a
lift
please
n
The
lift
is
going
up
n
Please
help
me
to
lift
this
table
v
light
adj
n
v
lighter
n
a
cigarette
lighter
lightn
ing
n
like
prep
v
likely
adj
limit
n
limite
d
adj
a
limite
d
choice
line
n
a
line
on
a
page
a
cloth
es
line
a
railway
line
link
n
a
link
to
a
webs
ite
lion
n
lip
n
liquid
n
list
n
listen
v
literature
n
litre
n
Br
Eng
Am
Eng
liter
litter
n
little
adj
det
pron
live
v
live
adj
live
music
sport
lively
adj
living
room
n
load
n
loan
n
local
adj
locate
v
The
station
is
located
in
the
city
centre
locati
on
n
lock
n
v
locker
n
logo
n
lonel
y
adj
long
adj
look
like
v
She
looks
like
her
sister
look
n
v
look
after
phr
v
Who
s
looking
after
your
baby
now
look
at
phr
v
look
for
phr
v
look
forward
to
phr
v
I
m
looking
forward
to
the
party
look
out
phr
v
Look
out
look
up
phr
v
Look
up
the
meaning
of
the
word
in
your
dictionary
loose
adj
lorry
n
lose
v
lost
adj
lots
I
a
lot
n
lotter
y
n
loud
adj
love
n
v
lovely
adj
low
adj
luck
n
lucky
adj
luggage
n
lunch
n
lunchtim
e
n
luxur
y
n
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
M
mach
ine
n
mad
adj
Madam
n
made
of
fro
m
out
of
v
Her
shirt
is
made
of
cotton
magazine
n
magic
adj
n
magnificent
adj
mail
n
v
main
adj
main
course
n
make
v
make
sure
v
make
up
n
male
adj
man
n
manag
e
v
to
manage
a
business
to
manage
to
do
something
succeed
in
manag
er
n
mango
n
many
det
pron
map
n
mark
n
market
n
to
buy
something
from
a
market
marriag
e
n
marrie
d
adj
marry
v
marvellous
adj
matc
h
n
v
a
box
of
matches
n
a
tennis
match
n
This
tie
matches
your
shirt
v
mate
n
material
n
maths
I
mathematic
s
n
Br
Eng
Am
Eng
math
matte
r
n
v
Is
anything
the
matter
n
It
doesn
t
matter
v
maximum
adj
n
may
mv
maybe
adv
me
pron
meal
n
mean
v
What
do
you
mean
What
does
it
mean
meaning
n
meanwhi
le
adv
meat
n
mechanic
n
medicine
n
mediu
m
adj
meet
v
meeting
n
melon
n
member
n
membership
n
memor
y
n
to
have
a
good
poor
memory
happy
memories
computer
memory
mend
v
mention
v
menu
n
mess
n
messag
e
n
messy
adj
metal
n
metho
d
n
modern
methods
of
teaching
metre
n
Br
Eng
Am
Eng
meter
microwav
e
n
a
microwave
oven
midda
y
n
middl
e
n
middl
e
aged
adj
midnigh
t
n
might
mv
mild
adj
mile
n
milk
n
millimetr
e
mm
n
Br
Eng
Am
Eng
millimeter
millio
n
n
mind
n
v
His
mind
was
on
other
things
n
Would
you
mind
if
I
called
tomorrow
v
Mind
your
head
v
Who
s
minding
the
baby
for
you
v
mine
pron
minera
l
water
n
minimum
adj
n
minus
prep
minut
e
n
mirro
r
n
miserabl
e
adj
miss
v
Miss
n
Missing
adj
Mistake
n
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
mix
v
mobile
phone
n
mode
l
n
It
s
cheap
because
it
s
last
year
s
model
n
She
s
a
fashion
model
n
moder
n
adj
moment
n
mone
y
n
monke
y
n
mont
h
n
monumen
t
n
mood
n
moon
n
more
adv
det
pron
mornin
g
n
mosquit
o
n
most
adv
det
pron
mothe
r
n
motorcycle
n
motorbik
e
n
moto
r
racin
g
n
motorway
n
mountai
n
n
mous
e
n
moustach
e
n
mout
h
n
move
v
movi
e
n
Am
Eng
Br
Eng
film
movi
e
star
n
Am
Eng
Br
Eng
film
star
movie
theat
er
n
Am
Eng
Br
Eng
cinema
MP
playe
r
n
Mr
n
Mrs
n
Ms
n
much
adv
det
pron
mug
n
mum
n
museum
n
mushroom
n
music
n
musical
adj
musician
n
must
mv
multipl
y
v
my
det
myself
pron
mystery
n
N
name
n
v
narrow
adj
nasty
adj
nationa
l
adj
nationalit
y
n
natural
adj
natur
e
n
natur
e
studies
navy
blue
adj
near
adv
prep
adj
nearby
adj
adv
nearly
adv
neat
adj
necessar
y
adj
neck
n
necklace
n
need
v
negativ
e
adj
neigh
bour
n
neigh
bourhood
n
neph
ew
n
nervous
adj
a
nervou
s
person
to
feel
nervous
net
n
networ
k
n
never
adv
new
adj
news
n
newspa
per
n
next
adj
adv
next
to
prep
nice
adj
niece
n
night
n
nightclu
b
n
nightlif
e
n
nightmar
e
n
no
adv
det
pron
nobo
dy
pron
noise
n
noisy
adj
none
pron
noon
n
no
one
pron
norma
l
adj
normall
y
adv
north
adj
adv
n
northe
ast
adj
n
northern
adj
northw
est
adj
n
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
nose
n
not
adv
note
n
v
to
write
a
note
n
a
ten
pound
note
n
Pleas
e
note
v
notebo
ok
n
notepa
per
n
nothing
pron
notice
n
v
to
read
a
notice
n
until
further
notice
n
Did
you
notice
anything
wrong
v
noticeboa
rd
n
novel
n
now
adv
nowad
ays
adv
nowh
ere
adv
number
n
numbers
to
a
large
number
of
cars
What
s
your
phone
number
nurse
n
O
object
n
obvious
adj
obviously
adv
occasion
n
occupatio
n
n
ocea
n
n
o
clock
adv
of
prep
of
cours
e
adv
off
adv
prep
It
fell
off
the
table
prep
The
meeting
is
off
adv
I
ve
got
the
afternoon
off
adv
offer
n
v
office
n
officer
n
often
adv
oh
exclam
oh
dear
exclam
oil
n
OK
I
O
K
okay
adj
exclam
old
adj
old
fashioned
adj
olive
n
omelett
e
n
on
adv
prep
on
board
prep
phr
on
busines
s
prep
phr
once
adv
once
a
year
I
once
saw
him
dancin
g
one
det
pron
on
fire
prep
phr
on
foot
prep
phr
on
holida
y
prep
phr
onion
n
online
adv
adj
to
book
buy
something
online
adv
an
online
printer
adj
only
adj
adv
on
purpose
prep
phr
on
request
prep
phr
on
sale
prep
phr
on
time
prep
phr
onto
prep
open
adj
v
opening
hours
n
pi
opera
n
operate
v
operation
n
opinion
n
oppo
rtunity
n
opposit
e
adj
n
prep
adv
optio
n
n
or
conj
orange
adj
n
orchestr
a
n
order
conj
n
v
in
order
to
conj
to
put
something
in
order
n
to
order
a
meal
v
ordina
ry
adj
organ
isation
n
organise
v
origina
l
adj
other
adj
pron
det
otherwise
adv
ought
mv
our
det
ours
pron
ourselve
s
pron
out
adv
outdo
or
adj
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
outdo
ors
adv
out
of
prep
out
of
date
prep
phr
out
of
order
prep
phr
out
of
work
prep
phr
outside
adv
adj
prep
oven
n
over
adv
prep
I
m
going
over
the
road
prep
over
people
more
than
adv
to
be
over
finished
adv
Several
birds
were
flying
over
the
roof
of
the
school
prep
overnight
adj
adv
owe
v
own
adj
pron
v
my
own
pen
adj
on
my
own
pron
to
own
a
car
v
owner
n
P
pack
v
to
pack
a
case
v
packet
n
page
n
pain
n
painful
adj
paint
n
v
painter
n
paintin
g
n
pair
n
palac
e
n
pale
adj
pale
blue
pan
n
pants
n
Am
Eng
Br
Eng
trousers
paper
n
a
shee
t
of
paper
a
news
paper
paragraph
n
parcel
n
pardon
exclam
Pardon
parent
n
park
n
v
a
publi
c
park
n
to
park
a
car
v
parkin
g
n
parkin
g
lot
n
Am
Eng
Br
Eng
car
park
parrot
n
part
n
a
part
of
somethin
g
n
partly
adv
particula
r
adj
I
love
this
CD
in
particular
the
last
song
partner
n
part
time
adv
part
time
adj
party
n
a
birthd
ay
party
a
political
party
pass
n
v
Severa
l
cars
passe
d
to
pass
the
sugar
to
pass
an
examination
passenger
n
passport
n
passwor
d
n
past
adj
n
prep
the
past
few
week
s
adj
in
the
past
n
It
s
half
past
one
prep
pasta
n
path
n
patien
t
adj
n
to
be
patie
nt
adj
a
hospital
patient
n
pattern
n
paus
e
v
pave
ment
n
pay
n
v
PC
person
al
compute
r
n
pea
n
peace
n
peaceful
adj
peach
n
peak
n
pean
ut
n
pear
n
pedestrian
n
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
peel
v
pen
n
penc
e
n
pi
penci
l
n
pencil
case
n
penfriend
n
pengu
in
n
penny
n
peopl
e
n
pi
pepp
er
n
to
pass
the
pepp
er
spice
red
peppers
vegetabl
e
per
prep
percent
adv
perfect
adj
perfor
m
v
perform
ance
n
performer
n
perfume
n
perhaps
adv
period
n
permanent
adj
permissio
n
n
permit
v
Dogs
are
not
permitted
here
permitte
d
adj
person
n
persona
l
adj
personal
ly
adv
persua
de
v
pet
n
petro
l
n
Br
Eng
Am
Eng
gas
petro
l
station
n
Br
Eng
Am
Eng
gas
statio
n
pharmac
y
n
phone
n
v
photo
n
photoco
py
n
photo
graph
n
photog
rapher
n
photog
raphy
n
phrase
n
physics
n
piano
n
pick
v
pick
up
phr
v
I
picked
up
a
pencil
I
ll
pick
up
my
sister
from
the
station
picnic
n
picture
n
pie
n
piece
n
a
piece
of
cheese
to
break
into
small
pieces
a
piece
of
furnitur
e
advice
pig
n
pile
n
pill
n
pillow
n
pilot
n
pin
n
v
pinea
pple
n
pink
adj
n
pipe
n
pirate
n
pity
n
It
s
a
pity
you
couldn
t
come
to
the
party
it
was
great
pizza
n
place
n
a
safe
place
n
I
ve
lost
my
place
in
the
book
n
third
place
in
a
race
n
London
is
a
big
place
n
plain
adj
It
s
plain
to
me
clear
a
plain
T
shirt
no
design
plan
n
v
a
street
plan
n
a
plan
to
do
someth
ing
n
plane
n
planet
n
plant
n
v
plast
ic
adj
n
plate
n
platform
n
play
n
v
a
play
at
the
theatre
n
children
playing
v
to
play
football
v
to
play
the
guitar
v
to
play
a
CD
v
to
play
the
part
of
someone
act
v
player
n
playground
n
pleasant
adj
please
exclam
v
Come
in
please
exclam
to
please
someone
v
pleased
adj
pleasure
n
plent
y
pron
plug
n
a
plug
for
the
bath
an
electrical
plug
plus
prep
conj
p
m
adv
pocket
n
pocket
mone
y
n
poem
n
poet
n
poetr
y
n
point
n
v
to
point
at
something
v
The
pencil
has
no
point
on
it
n
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
police
n
policeman
n
polic
e
office
r
n
polic
e
statio
n
n
polite
adj
political
adj
politician
n
politics
n
pollution
n
pool
n
a
swimmin
g
pool
poor
adj
She
is
very
poor
financial
the
poor
man
sympathy
pop
n
pop
song
m
usic
sta
r
group
popular
adj
population
n
port
n
positi
on
n
positive
adj
possibility
n
possible
adj
possibl
y
adv
post
n
v
to
post
a
letter
v
to
send
it
by
post
n
postcard
n
poster
n
postma
n
n
post
office
n
postpone
v
pot
n
potat
o
n
poun
d
n
pour
v
powder
n
power
n
powerful
adj
practice
n
practise
v
n
Am
Eng
pray
v
prayer
n
predict
v
prefer
v
preg
nant
adj
prepar
ation
n
prep
are
v
prep
ared
adj
prescription
n
medic
ine
on
a
prescript
ion
present
adj
n
to
be
present
adj
at
the
present
time
adj
That
will
be
all
for
the
present
n
I
got
some
lovely
birthday
presents
n
presenta
tion
n
president
n
press
v
to
press
a
button
to
press
a
suit
pretty
adj
adv
prevent
v
previou
s
adj
previo
usly
adv
price
n
primary
school
n
prince
n
princess
n
principa
l
adj
print
v
to
print
a
docume
nt
printer
n
priso
n
n
prisone
r
n
privat
e
adj
prize
n
probably
adv
problem
n
produce
v
product
n
professio
n
n
professional
n
professo
r
n
program
me
n
TV
programme
computer
program
progress
n
project
n
promis
e
n
v
to
promis
e
to
do
something
v
to
keep
a
promise
n
promot
e
v
pronounc
e
v
to
prono
unce
a
word
correctly
pronunciatio
n
n
proper
adj
property
n
protect
v
proud
adj
prove
v
provide
v
publi
c
adj
n
public
opinion
adj
to
make
something
public
adj
to
be
open
to
th
e
public
n
publi
c
transpor
t
n
publis
h
v
pull
v
pullover
n
pump
n
petrol
bik
e
pump
punis
h
v
pupil
n
puppy
n
pure
adj
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
purpl
e
adj
n
purpose
n
He
did
it
on
purpose
deliberately
purse
n
push
n
v
put
v
put
away
phr
v
He
put
the
book
away
put
down
phr
v
She
put
her
name
down
put
off
phr
v
The
meetin
g
was
put
off
until
the
followin
g
week
put
on
phr
v
He
put
on
a
suit
Can
you
p
ut
on
the
light
He
didn
t
want
to
put
on
weight
put
out
phr
v
The
fire
was
quickly
put
out
put
throug
h
phr
v
Can
you
put
me
through
to
the
manage
r
please
put
up
phr
v
The
company
had
to
put
up
its
prices
puzzl
e
n
pyjamas
n
pi
Q
qualifica
tion
n
qualifie
d
adj
qualit
y
n
quantit
y
n
quarte
r
n
queen
n
questio
n
n
to
ask
a
question
the
questio
n
being
discussed
subject
questionnai
re
n
queue
n
quick
adj
quickl
y
adv
quiet
adj
quit
v
quite
adv
Are
you
quite
sure
quite
old
quiz
n
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
R
rabbi
t
n
race
n
v
to
win
a
race
n
to
race
against
fast
runners
compete
v
to
race
home
quickl
y
run
v
racket
n
tennis
racket
radio
n
rail
n
to
go
by
rail
railwa
y
n
rain
n
v
raincoa
t
n
rainfores
t
n
raise
v
to
raise
your
arm
to
raise
prices
range
n
rap
n
rare
adj
rarely
adv
rather
adv
She
s
rather
tall
for
her
age
I
d
rather
go
to
the
cinema
than
the
theatre
Shall
we
stay
in
tonight
rather
than
go
out
raw
a
dj
raw
meat
reach
v
read
v
reader
n
readi
ng
n
ready
adj
real
adj
realis
e
v
He
realise
d
it
was
true
realistic
adj
really
adv
reason
n
reasona
ble
adj
reasona
bly
adv
rebuil
d
v
receipt
n
receiv
e
v
recent
adj
receptio
n
n
receptionist
n
recip
e
n
recognise
v
recommend
v
to
recommend
someone
something
recor
d
n
v
to
keep
a
recor
d
n
to
break
a
recor
d
n
to
recor
d
a
song
v
recordi
ng
n
recov
er
v
to
recove
r
from
an
illness
recycle
v
I
don
t
recycle
as
much
as
I
should
recycled
adj
recycling
n
red
adj
reduc
e
v
refreshments
n
pi
refrigerator
n
refun
d
n
refuse
v
regardi
ng
prep
regards
n
region
n
registe
r
v
He
registered
with
a
new
doctor
v
registration
n
regret
n
v
regul
ar
adj
relatio
n
n
to
visit
a
relation
relationshi
p
n
relative
n
a
relativ
e
came
to
stay
relax
v
relaxatio
n
n
relaxe
d
adj
reliabl
e
adj
religion
n
remai
n
v
remembe
r
v
remin
d
v
remot
e
control
n
remov
e
v
rent
n
v
repair
n
v
repeat
v
replace
v
reply
n
v
report
n
v
reporter
n
request
n
v
requi
re
v
rescu
e
n
v
research
v
reservatio
n
n
reserv
e
n
v
She
was
a
reserve
for
the
team
n
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
to
reserv
e
a
seat
v
resor
t
n
respect
n
v
responsibl
e
adj
rest
n
v
a
rest
from
work
n
the
rest
of
them
n
The
doctor
told
her
to
rest
v
restauran
t
n
result
n
retire
v
return
n
v
to
return
home
v
a
return
ticket
n
review
n
revise
v
revision
n
reward
n
rice
n
rich
adj
ride
n
v
rider
n
right
adj
adv
n
the
right
time
correct
adj
the
right
person
for
the
job
suitable
adj
my
right
foot
adj
Everything
will
be
all
right
adj
Go
right
there
directly
adv
Fill
it
right
to
the
top
completely
adv
the
right
to
vote
n
right
hand
adj
ring
n
v
stand
in
a
ring
n
a
wedding
ring
n
Give
me
a
ring
tomorr
ow
phone
n
Suddenly
the
bell
rang
v
ring
back
phr
v
ring
up
phr
v
to
telephon
e
somebody
rise
v
The
sun
rises
in
the
east
Price
s
are
rising
river
n
road
n
roast
adj
v
rob
v
rock
n
rock
music
n
a
hard
piece
of
rock
n
role
n
roll
n
a
roll
of
film
n
a
bread
roll
n
romanc
e
n
romantic
adj
roof
n
room
n
the
sitting
room
There
s
lots
of
room
in
here
rose
n
rough
adj
a
rough
road
a
rough
idea
rough
work
round
adj
adv
prep
a
round
object
adj
the
wrong
way
round
adv
to
sit
round
a
table
prep
roundabout
n
route
n
routin
e
n
row
n
a
row
of
seats
rubber
n
a
rubber
eraser
rubbis
h
n
rude
adj
rug
n
rugby
n
ruin
n
rule
n
v
the
rules
of
gramma
r
n
to
rule
a
countr
y
v
ruler
n
draw
a
line
using
a
ruler
run
v
to
run
in
a
race
to
run
a
business
runner
n
runni
ng
n
run
out
phr
v
He
ran
out
of
time
and
didn
t
finish
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
S
sad
adj
safe
adj
to
be
safe
from
harm
safely
adv
sail
n
v
sailin
g
n
salad
n
salar
y
n
sale
n
salesman
sa
leswoman
n
salmon
n
salt
n
same
adj
pron
adv
at
the
same
time
adj
Your
watch
is
the
same
as
mine
pron
You
shoul
d
treat
everyone
the
same
adv
sand
n
sanda
l
n
sandwic
h
n
satisfactory
adj
satisfie
d
adj
sauc
e
n
saucepa
n
n
sauce
r
n
sausage
n
save
v
to
save
someone
to
save
money
to
save
time
say
v
to
say
something
to
someone
I
really
can
t
say
give
an
opinion
scare
d
adj
scarf
n
scary
adj
scen
e
n
scener
y
n
school
n
schoolchild
n
science
n
science
fiction
n
scientif
ic
adj
scienti
st
n
scissors
n
pi
scooter
n
score
n
v
The
score
was
n
to
score
a
goal
v
scream
n
v
scree
n
n
sculptur
e
n
sea
n
searc
h
n
v
seasid
e
n
season
n
seat
n
seat
belt
n
secon
d
adv
det
n
She
came
second
and
won
silver
adv
This
is
the
second
time
you
ve
been
late
det
sixty
seconds
in
a
minute
n
secondar
y
adj
seconda
ry
school
second
hand
adj
adv
secret
adj
n
secretary
n
section
n
security
n
see
v
to
see
something
with
the
eyes
to
see
the
joke
understand
to
see
someone
about
a
problem
consult
seem
v
select
v
selfish
adj
self
service
adj
sell
v
send
v
sens
e
n
sensibl
e
adj
sentence
n
word
s
in
a
sentence
separat
e
adj
series
n
a
TV
series
seriou
s
adj
a
serious
person
a
serious
illness
seriously
adv
serve
v
to
serve
in
a
shop
serve
r
n
a
file
server
servic
e
n
a
bus
service
customer
service
session
n
in
a
schoo
l
gym
set
n
v
set
off
phr
v
She
set
off
early
for
work
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
set
out
phr
v
They
set
out
on
the
long
journey
set
up
phr
v
Her
mother
helped
her
to
set
up
in
business
several
det
pron
sew
v
sex
n
the
male
female
sex
shad
e
n
to
sit
in
the
shade
shado
w
n
shak
e
v
shall
mv
sham
e
n
shampoo
n
shap
e
n
share
v
shark
n
sharp
adj
a
sharp
knife
a
sharp
corner
a
sharp
picture
shave
v
she
pron
sheep
n
sheet
n
sheet
s
on
a
bed
a
shee
t
of
paper
informatio
n
sheet
shelf
n
shine
v
shiny
adj
ship
n
shirt
n
shock
n
to
suffer
from
shock
n
shocke
d
adj
shocking
adj
shoe
n
shoot
v
to
shoo
t
at
the
goal
shop
n
v
shop
assistan
t
n
shopping
n
shore
n
short
adj
shortly
adv
short
s
n
pi
a
pair
of
shorts
shoul
d
mv
shoulde
r
n
shou
t
n
v
show
n
v
a
film
show
n
Show
it
to
me
v
The
picture
shows
a
village
v
It
shows
that
they
care
v
showe
r
n
a
showe
r
of
rain
to
have
a
shower
shut
adj
v
shy
adj
sick
adj
side
n
sight
n
Her
sight
is
better
with
glasses
in
sight
out
of
sight
sightseein
g
n
sign
n
v
a
road
sign
n
to
sign
a
documen
t
v
no
sign
of
life
n
signs
of
winte
r
n
signa
l
n
v
signatur
e
n
signpost
n
silenc
e
n
silent
adj
silk
adj
n
silly
adj
silver
adj
n
similar
adj
simple
adj
since
conj
prep
sincerel
y
adv
Yours
sincerely
sing
v
singe
r
n
singin
g
n
single
n
adj
a
single
ticket
to
Manchester
n
to
be
single
unmarried
adj
a
single
room
adj
sink
n
v
a
kitche
n
sink
n
The
ship
began
to
sink
v
sir
n
Yes
sir
sister
n
sit
v
sit
down
phr
v
site
n
sitting
room
n
situate
d
adj
situatio
n
n
size
n
skate
n
v
skateboar
d
n
v
skateboardi
ng
n
skating
n
ski
n
v
skiing
n
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
skill
n
skin
n
skirt
n
sky
n
sleep
n
v
sleeve
n
slice
n
slim
adj
slip
v
to
slip
on
the
ice
slow
adj
slowly
adv
small
adj
smart
adj
a
smar
t
idea
Am
Eng
smart
cloth
es
smel
l
n
v
smile
n
v
smoke
n
v
smoking
n
smoot
h
adj
a
smooth
surface
level
a
smooth
ride
in
the
new
car
comfortable
snack
n
snak
e
n
snow
n
v
snowbo
ard
n
v
snowbo
arding
n
so
adv
conj
soap
n
soap
opera
n
soccer
n
sociabl
e
adj
social
adj
society
n
sock
n
sofa
n
soft
adj
a
soft
m
aterial
a
soft
drink
softwar
e
n
soldier
n
solutio
n
n
solve
n
some
det
pron
somebod
y
pron
someho
w
adv
someone
pron
something
pron
sometimes
adv
somewhe
re
adv
son
n
song
n
soon
adv
I
ll
come
soon
as
soon
as
I
can
sore
adj
sorry
adj
sort
n
the
same
sort
so
so
adj
soul
n
soun
d
n
v
the
sound
of
musi
c
n
It
sounds
like
as
if
v
soup
n
sour
adj
a
sour
taste
south
adj
adv
n
southeast
adj
n
souther
n
adj
southwest
adj
n
souveni
r
n
spac
e
n
a
parkin
g
space
write
in
the
spaces
not
enou
gh
space
outer
space
spare
adj
v
spare
cash
spare
time
adj
to
spare
the
time
v
sparklin
g
adj
Sparklin
g
water
pleas
e
speak
v
speaker
n
special
adj
spectacula
r
adj
speec
h
n
spee
d
n
spell
v
spellin
g
n
spend
v
to
spen
d
money
time
spice
n
spicy
adj
spill
v
spinac
h
n
spite
n
in
spite
of
split
up
phr
v
She
s
just
split
up
with
her
boyfriend
spoil
v
spoon
n
sport
n
sports
centre
n
spot
n
spy
n
squar
e
adj
n
a
squar
e
room
adj
a
marke
t
squar
e
n
squas
h
n
stadium
n
staff
n
stage
n
to
perfor
m
on
a
stage
stairs
n
pi
stall
n
market
stall
stamp
n
a
postag
e
stamp
stand
v
star
n
stars
in
the
sky
n
Page
of
Cambridge
English
Preliminary
and
Preliminary
for
Schools
Vocabular
y
List
a
film
star
n
start
n
v
a
good
start
n
to
start
a
race
v
station
n
a
bus
fire
radio
station
statue
n
stay
n
v
to
stay
to
dinne
r
v
to
stay
with
friend
s
v
to
stay
looking
young
v
a
two
night
stay
n
stay
behin
d
phr
v
She
stayed
behind
after
the
lesson
to
speak
to
the
teacher
steak
n
steal
v
steep
adj
step
n
two
steps
forward
to
climb
the
steps
stick
n
v
a
walking
stick
n
to
stick
two
things
together
v
sticky
adj
still
adj
adv
I
prefer
still
to
sparkling
water
adj
Sit
still
adv
She
s
still
here
adv
stir
v
stomach
n
stomac
h
ache
n
stone
n
a
large
stone
a
stone
bridge
stop
n
v
a
bus
stop
n
The
car
stopped
v
It
s
stoppe
d
rainin
g
v
The
rain
stopped
me
from
going
out
v
store
n
a
department
store
n
storm
n
story
n
straigh
t
adj
adv
to
go
straigh
t
on
adv
a
straigh
t
road
adj
strang
e
adj
stranger
n
